In [1]:
import pandas as pd

# Python SQL toolkit and Object Relational Mapper, sql
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, inspect, func

# make sure that the file is .py use separate file not to display connection data in notebook
# the connect string is a separate python file with the name  of the database connection information
# to load create a notebook named dbconnection.py with the connection information for your database 
# same in the same location as this notebook 
# example connection string to place in python file 
# connect_string='postgresql://nameofpostgresuser:Password@localhost:5433/cardata'
from dbconnection import connect_string

In [2]:
#load the dataset from csv file into a panda dataframe
df = pd.read_csv("Resources/carvana_carvana_car_sold-2022-08.csv", index_col = False)
df.head(2)

,vehicle_id,stock_number,year,make,model,miles,trim,sold_price,discounted_sold_price,partnered_dealership,delivery_fee,earliest_delivery_date,sold_date
0,2270123,2001646447,2014,Volkswagen,Jetta,53238,2.0L S,15990,15990,False,1490,2022-09-09T21:34:31.376Z,2022-08-31
1,2298228,2001690283,2015,Chevrolet,Volt,112160,base,17590,17590,False,790,2022-09-09T22:04:42.555Z,2022-08-31

In [3]:
#display count of rows in each column
df.count()

vehicle_id                44365
stock_number              44365
year                      44365
make                      44365
model                     44365
miles                     44365
trim                      44365
sold_price                44365
discounted_sold_price     44365
partnered_dealership      44365
delivery_fee              44365
earliest_delivery_date    44365
sold_date                 44365
dtype: int64

In [4]:
#drop NA values and display 2 rows of dataframe
df = df.dropna()
df.head(2)

,vehicle_id,stock_number,year,make,model,miles,trim,sold_price,discounted_sold_price,partnered_dealership,delivery_fee,earliest_delivery_date,sold_date
0,2270123,2001646447,2014,Volkswagen,Jetta,53238,2.0L S,15990,15990,False,1490,2022-09-09T21:34:31.376Z,2022-08-31
1,2298228,2001690283,2015,Chevrolet,Volt,112160,base,17590,17590,False,790,2022-09-09T22:04:42.555Z,2022-08-31

In [5]:
#create  filter car types into dataframe for cartypes
cartypes_df=df[["make","model","trim"]].drop_duplicates()

In [6]:
#check results of dataframe
cartypes_df.head(2)

         make  model    trim
0  Volkswagen  Jetta  2.0L S
1   Chevrolet   Volt    base

In [7]:
 # create variable to hold columns for car details
cardetails_col = (
     "vehicle_id"
     ,"stock_number"
     , "sold_price"
     ,"discounted_sold_price"
     ,"delivery_fee"
     ,"sold_date")

In [8]:
# create dataframe of just cardetails and use variable to filter the columns 
cardetails_df = df.filter (cardetails_col).drop_duplicates()
cardetails_df.head(2)

,vehicle_id,stock_number,sold_price,discounted_sold_price,delivery_fee,sold_date
0,2270123,2001646447,15990,15990,1490,2022-08-31
1,2298228,2001690283,17590,17590,790,2022-08-31

In [9]:
#create dataframe for car inventory with specific columns and drop duplicates
inventoryCol = ('stock_number','year','make','model','trim','miles' )
carinventory_df = df.filter(inventoryCol).drop_duplicates()
carinventory_df.head(2)

   stock_number  year        make  model    trim   miles
0    2001646447  2014  Volkswagen  Jetta  2.0L S   53238
1    2001690283  2015   Chevrolet   Volt    base  112160

In [10]:
#create sql engine connection to Postgres database
engine = create_engine (connect_string)

In [11]:
#load data from dataframe cardetails to cardetails in Postgres database
cardetails_df.to_sql(
    'cardetails' 
    ,engine
    ,index=False # Not copying over the index
    ,if_exists='replace'
)

357

In [12]:
# load data from carinventory dataframe to carinventory table in Postgres
carinventory_df.to_sql('carinventory'
                      ,engine
                      ,index=False
                      ,if_exists='replace')

357

In [13]:
#Load data from cartypes dataframe into cartypes table in Postgres
cartypes_df.to_sql('cartypes'
                      ,engine
                      ,index=False
                      ,if_exists='replace')

192

In [14]:
#verify tables were created
inspector = inspect(engine)
inspector.get_table_names()

['cardetails', 'carinventory', 'cartypes']